Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: ལུས་ཀྱི་སྡོམ་པ་དང་ངག་གི་སྡོམ་པ་དང་ཡིད་ཀྱི་སྡོམ་པ་དང་ལས་ཡོངས་སུ་དག་པ་དང་དམིགས་པ་ལས་ཡང་དག་པར་འདའ་བ་དང་ཕུང་པོ་ཡོངས་སུ་ཤེས་པ་དང་། ཁམས་མཉམ་པ་ཉིད་དང་སྐྱེ་མཆེད་སེལ་བ་དང་སྲེད་པ་སྤོང་བ་དང་མི་སྐྱེ་བ་མངོན་སུམ་དུ་བྱེད་པ་ལ་འཇུག་པ་དང་རྒྱུ་གསལ་བར་བྱེད་པ་དང་ལས་ཀྱི་འབྲས་བུ་ཆུད་མི་གསོན་པ་དང་ཆོས་མཐོང་བ་དང་ལམ་སྒོམ་པ་དང་དེ་བཞིན་གཤེགས་པ་ལ་སྟེན་པ་དང་ཤེས་རབ་རྣོ་བ་དང་བདེན་པའི་རྗེས་སུ་འཇུག་པ་དང་ཆོས་ཤེས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་འཇུག་པ་ཤེས་པ་དང་ཡི་གེ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་ཤེས་པ་དང་དངོས་པོ་རྣམས་ལས་ཡང་དག་པར་འདའ་བ་དང་། སྒྲ་ཡོངས་སུ་ཤེས་པ་དང་དགའ་བ་རབ་ཏུ་ཐོབ་པ་དང་ཆོས་ཀྱི་དགའ་བ་རྗེས་སུ་མྱོང་བ་དང་དྲང་བ་དང་། མཉེན་པ་དང་ཤུགས་དྲང་བ་དང་གྱ་གྱུ་མེད་པ་དང་ཁྲོས་གཉེར་དང་བྲལ་བ་དང་དེས་པ་དང་ངང་ཚུལ་དགེ་བ་དང་བྱམས་པར་འཛིན་པ་དང་འཇམ་པ་དང་བཞིན་འཛུམ་པ་དང་གསོང་པོར་སྨྲ་བ་དང་ལེགས་པར་འོངས་སོ། །ཚུར་ཤོག་ཅེས་སྨྲ་བ་དང་ལེ་ལོ་མེད་པ་དང་བླ་མ་ལ་གུས་པ་དང་བླ་མ་ལ་སྲི་ཞུ་ཆེ་བ་དང་སྐྱེ་བས་ཆོག་ཤེས་པ་དང་ཆོས་དཀར་པོས་མི་ངོམས་པ་དང་འཚོ་བ་རྣམ་པར་དག་པ་དང་དགོན་པ་ལ་གནས་པ་མི་གཏོང་བ་དང་ས་རྣམ་པར་བཞག་པ་ཤེས་པ་དང་དྲན་པ་ཆུད་མི་གཟོན་པ་དང་། ཕུང་པོ་ལ་མཁས་པ་དང་ཁམས་ལ་མཁས་པ་དང་སྐྱེ་མཆེད་ལ་མཁས་པ་དང་མངོན་པར་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་ལ་འཇུག་པ་དང་། ཉོན་མོངས་པ་སེལ་བ་དང་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཡང་དག་པར་འཇོམས་པ་དང་། ཁྱད་པར་དུ་འགྲོ་བ་དང་བསྒོམ་པའི་རྒྱུ་འཐུན་པ་དང་ཉེས་པ་ལས་དབྱུང་བ་ལ་མཁས་པ་དང་ཀུན་ནས་ལྡང་བ་གནོན་པ་དང་བག་ལ་ཉལ་སྤོང་བ་དང་སྲིད་པ་ལས་ཡང་དག་པར་འདའ་བ་དང་སྐྱེ་བ་དྲན་པ་དང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ནེམ་ནུར་མེད་པ་དང་ཆོས་སེམས་པ་དང་ཐོས་པ་ཚོལ་བ་དང་། ཡེ་ཤེས་རྣོ་བ་དང་ཡེ་ཤེས་ལ་སྲེད་པ་དང་ཡེ་ཤེས་རྗེས་སུ་རྟོགས་པ་དང་ཅང་ཤེས་ཀྱི་ས་དང་སེམས་རི་ལྟ་བུ་དང་མི་སྒུལ་བ་དང་མི་གཡོ་བ་དང་ཕྱིར་མི་ལྡོག་པའི་ས་རྣམ་པར་གཞག་པ་ཤེས་པ་དང་། དགེ་བའི་ཆོས་ཀྱི་རྒྱུ་འཐུན་པ་དང་སྡིག་པའི་ཆོས་ལ་སྨོད་པ་དང་ཉོན་མོངས་པ་རྣམས་ཀྱི་རྒྱུ་བ་མེད་པ་དང་བསླབ་པ་ཡོངས་སུ་མི་གཏོང་བ་དང་། ཏིང་ངེ་འཛིན་རྣམ་པར་འཇོག་པ་དང་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཤེས་པ་དང་། སྐྱེ་བའི་ཁྱད་པར་ཤེས་པ་དང་མཉམ་པ་ཉིད་ཤེས་པ་དང་ཚིག་གི་མཚམས་སྦྱར་བ་ཤེས་པ་དང་ཁྱིམ་ན་གནས་པ་ཡོངས་སུ་གཏོང་བ་དང་། ཁམས་གསུམ་ལ་མངོན་པར་མི་དགའ་བ་དང་སེམས་ཞུམ་པ་མེད་པ་དང་ཆོས་ལ་མངོན་པར་ཞེན་པ་མེད་པ་དང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་དང་ཆོས་སྲུང་བ་དང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡིད་ཆེས་པ་དང་འདུལ་བ་ལ་མཁས་པ་དང་རྩོད་པའི་གཞི་ཞི་བར་བྱེད་པ་དང་འགྱེད་པ་མེད་པ་དང་རྩོད་པ་མེད་པ་དང་བཟོད་པའི་ས་དང་བཟོད་པ་ཡང་དག་པར་འཛིན་པ་དང་འགྲོ་བ་མཉམ་པ་དང་ཆོས་རབ་ཏུ་དབྱེ་བ་ལ་མཁས་པ་དང་ཆོས་གཏན་ལ་དབབ་པ་ལ་མཁས་པ་དང་ཆོས་ཀྱི་ཚིག་རབ་ཏུ་དབྱེ་བ་ཤེས་པ་དང་ཆོས་ཀྱི་ཚིག་ངེས་པར་དགོད་པ་ལ་མཁས་པ་དང་། སྔོན་གྱི་མཐའ་ཤེས་པ་དང་ཕྱི་མའི་མཐའ་ཤེས་པ་དང་ད་ལྟར་བྱུང་བ་ཤེས་པ་དང་དུས་གསུམ་མཉམ་པ་ཉིད་ཤེས་པ་དང་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ཤེས་པ་དང་། ལུས་གནས་པ་ཤེས་པ་དང་སེམས་གནས་པ་ཤེས་པ་དང་སྤྱོད་ལམ་སྲུང་བ་དང་སྤྱོད་ལམ་མི་འཁྲུགས་པ་དང་སྤྱོད་ལམ་མི་འཆོས་པ་དང་སྤྱོད་ལམ་མཛེས་པ་དང་དོན་དང་དོན་མ་ཡིན་པ་ལ་མཁས་ཤིང་ཤེས་པ་དང་རིགས་པར་སྨྲ་བ་དང་། འཇིག་རྟེན་ཤེས་པ་དང་ལྷུག་པར་གཏོང་བ་དང་ལག་བརྐྱང་བ་དང་སེམས་ཀྱིས་འཛིན་པ་མེད་པ་དང་ངོ་ཚ་ཤེས་པ་དང་ཁྲེལ་ཡོད་པ་དང་། མི་དགེ་བའི་སེམས་ལ་སྨོད་པ་དང་སྦྱངས་པའི་ཡོན་ཏན་མི་གཏོང་བ་དང་ཆོ་ག་ཡང་དག་པར་འཛིན་པ་དང་དགའ་བར་སྤྱོད་པ་དང་བླ་མ་ལ་ལྡང་ཞིང་སྟན་འདིང་བ་དང་ང་རྒྱལ་ཚར་གཅོད་པ་དང་སེམས་ཡང་དག་པར་རབ་ཏུ་འཛིན་པ་དང་སེམས་སྐྱེ་བ་ཤེས་པ་དང་དོན་རྟོགས་པར་ཤེས་པ་དང་ཡེ་ཤེས་རྗེས་སུ་རྟོགས་པ་དང་། མི་ཤེས་པ་མེད་པར་གྱུར་པ་དང་སེམས་ལ་འཇུག་པ་ཤེས་པ་དང་སེམས་ཀྱི་རང་བཞིན་རྗེས་སུ་རྟོགས་པ་ཤེས་པ་དང་། སྒྲུབ་པ་དང་ངེས་པར་སྒྲུབ་པ་ལ་མཁས་པའི་ཤེས་པ་དང་སྒྲ་སྐད་ཐམས་ཅད་ཤེས་པ་དང་ངེས་པའི་ཚིག་རྣམ་པར་གཞག་པ་ཤེས་པ་དང་དོན་གཏན་ལ་དབབ་པར་ཤེས་པ་དང་གནོད་པ་རྣམ་པར་སྤོང་བ་དང་། སྐྱེས་བུ་དམ་པ་དང་འགྲོགས་པ་དང་སྐྱེས་བུ་ངན་པ་རྣམ་པར་སྤོང་བ་དང་བསམ་གཏན་རྣམས་སྒྲུབ་ཅིང་དེ་ལ་རོ་མྱོང་བར་མི་བྱེད་པ་དང་མངོན་པར་ཤེས་པས་རྣམ་པར་འཕྲུལ་པ་དང་། མིང་དང་བརྡ་དང་གདགས་པའི་ངོ་བོ་ཉིད་ལ་འཇུག་པ་ཤེས་པ་དང་། བཏགས་པ་ཡང་དག་པར་འཇོམས་པ་དང་འདུ་བྱེད་རྣམས་ལ་སྐྱོ་བ་དང་བཀུར་སྟི་མི་འདོད་པ་དང་བཀུར་སྟི་མེད་པ་ལ་བཏང་སྙོམས་སུ་བྱེད་པ་དང་རྙེད་པ་ལ་དོན་དུ་མི་གཉེར་བ་དང་རྙེད་པ་མེད་པ་ལ་ཞུམ་པ་མེད་པ་དང་སྙན་པ་མི་འདོད་པ་དང་མི་སྙན་པ་ལ་ཁོང་ཁྲོ་བ་མེད་པ་དང་བསྟོད་པ་ལ་དགའ་བ་མེད་པ་དང་སྨད་པ་ལ་མི་དགའ་བ་མེད་པ་དང་བདེ་བ་ལ་མངོན་པར་མ་ཆགས་པ་དང་སྡུག་བསྔལ་ལ་ཡིད་འབྱུང་བར་མི་བྱེད་པ་དང་འདུ་བྱེད་རྣམས་ལེན་པར་མི་བྱེད་པ་དང་བསྔགས་པ་ཡང་དག་པ་ལ་མ་ཆགས་པ་དང་བསྔགས་པ་ཡང་དག་པ་མ་ཡིན་པ་ལ་མི་མཇེད་པ་དང་། ཁྱིམ་པ་དང་རབ་ཏུ་བྱུང་བ་དག་དང་མི་སྟེན་པ་དང་། སྤྱོད་ཡུལ་མ་ཡིན་པ་རྣམ་པར་སྤོང་བ་དང་སྤྱོད་ཡུལ་དུ་རྒྱུ་བ་དང་སྤྱོད་པ་ཕུན་སུམ་ཚོགས་པ་དང་སྤྱོད་པ་མ་ཡིན་པ་རྣམ་པར་སྤོང་བ་དང་། རིགས་སུན་པར་མི་བྱེད་པ་དང་བསྟན་པ་སྲུང་བ་དང་སྨྲ་བ་ཉུང་ཞིང་མཉེན་པ་དང་དལ་གྱིས་སྨྲ་བ་དང་། ཚིག་གི་ལན་བླ་ན་པ་ལ་མཁས་པ་དང་ཕྱིར་རྒོལ་བ་ཚར་གཅོད་པ་དང་དུས་སུ་འགྲོ་བར་བྱེད་པ་དང་སོ་སོའི་སྐྱེ་བོ་ལ་ཡིད་མི་རྟོན་པ་དང་སྡུག་བསྔལ་བ་རྣམས་ཁྱད་དུ་གསོད་པར་མི་བྱེད་ཅིང་དེ་དག་ལ་ནོར་སྦྱིན་པ་དང་། དབུལ་པོ་རྣམས་ལ་བརྙས་པར་མི་བྱེད་པ་དང་ཚུལ་ཁྲིམས་འཆལ་པ་ལ་སྙིང་རྗེ་བ་དང་ཕན་པའི་དངོས་པོ་དང་སྙིང་བརྩེ་བའི་བློ་དང་ཆོས་ཀྱིས་ཕན་འདོགས་པ་དང་ཟང་ཟིང་ཡོངས་སུ་གཏོང་བ་དང་། མི་སྩོགས་པར་གནས་པ་དང་ཚུལ་ཁྲིམས་ལ་སྟོད་ཅིང་འཆལ་པའི་ཚུལ་ཁྲིམས་ལ་སྨོད་པ་དང་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ལ་གཡོ་མེད་པར་སྟེན་པ་དང་། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དང་ལྷག་པའི་བསམ་པས་གཉེར་བ་དང་། ཇི་སྐད་སྨྲས་པ་བཞིན་བྱེད་པ་དང་རྒྱུན་མི་ཆད་པར་སྦྱོར་བ་དང་གུས་པར་བྱས་ཏེ་དགའ་བ་མྱོང་བར་བྱེད་པ་དང་། དཔེ་ཤེས་པ་དང་སྔོན་བྱུང་བ་ལ་མཁས་པ་དང་དགེ་བའི་རྩ་བ་སྔོན་དུ་འགྲོ་བ་དང་ཐབས་ལ་མཁས་པ་དང་མཚན་མ་སྤོང་བ་དང་འདུ་ཤེས་ཟློག་པ་དང་དངོས་པོ་རྣམས་ཡོངས་སུ་ཤེས་པ་དང་། མདོ་སྡེ་མངོན་པར་སྒྲུབ་པ་དང་འདུལ་བ་ལ་མཁས་པ་དང་བདེན་པ་གཏན་ལ་འབེབས་པ་དང་རྣམ་པར་གྲོལ་བ་མངོན་སུམ་དུ་བྱ་བ་ལ་འཇུག་པ་དང་། ཚིག་མགོ་གཅིག་ཏུ་སྨྲ་བ་དང་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་ཤིང་མཐོང་བ་མི་གཏོང་བ་དང་། ནེམ་ནུར་མེད་པའི་ཚིག་དང་སྟོང་པ་ཉིད་ལ་སྟེན་པ་དང་མཚན་མ་མེད་པ་ལ་སྟེན་པ་དང་སྨོན་པ་མེད་པའི་ངོ་བོ་ཉིད་རྟོགས་པར་བྱེད་པ་དང་མི་འཇིགས་པ་ཐོབ་པ་དང་ཡེ་ཤེས་ཀྱིས་སྣང་བར་བྱེད་པ་དང་ཚུལ་ཁྲིམས་དམ་པ་དང་། སྙོམས་པར་འཇུག་པ་ལ་གཞོལ་བ་དང་། གཅིག་པུར་དགའ་བ་དང་། བདག་ཤེས་པ་དང་ཤེས་ཀྱི་ཁེ་ཉུང་ངུས་ཆོག་ཤེས་པ་དང་སེམས་ལ་རྙོག་པ་མེད་པ་དང་ལྟ་བར་གྱུར་པ་རྣམ་པར་སྤོང་བ་དང་། གཟུངས་ཐོབ་པ་དང་ཡེ་ཤེས་ལ་འཇུག་པ་དང་གནས་དང་གནས་མ་ཡིན་པ་དང་། འཇུག་པ་དང་སྒྲུབ་པ་ཤེས་པ་དང་གཏན་ཚིགས་དང་། རིགས་པ་དང་ཚུལ་དང་སྒོ་དང་རྒྱུ་དང་ལམ་དང་ནན་ཏན་དང་སྒྲུབ་པ་དང་ཕྲིན་དང་གདམས་པ་དང་བསྟེན་པ་ལ་སྤྱོད་པ་དང་། རྗེས་སུ་འཐུན་པའི་བཟོད་པ་དང་བཟོད་པའི་ས་དང་མི་བཟོད་པ་དང་བྲལ་བ་དང་ཡེ་ཤེས་ཀྱི་ས་དང་མི་ཤེས་པ་སྤོང་བ་དང་ཤེས་པ་ལ་གནས་པ་དང་རྣལ་འབྱོར་སྤྱོད་པའི་ས་དང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་དང་། སྐྱེས་བུ་དམ་པ་ལ་བསྟེན་པ་དང་སྐྱེས་བུ་དམ་པ་མ་ཡིན་པ་སྤོང་བ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་རྟོགས་ཤིང་ཁོང་དུ་ཆུད་པར་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སངས་རྒྱས་ཀྱི་ས་དང་མཁས་པ་རྣམས་ཀྱིས་རྗེས་སུ་ཡི་རང་བ་དང་བྱིས་པ་རྣམས་ཀྱིས་སྤངས་པ་དང་ཉན་ཐོས་རྣམས་ཀྱིས་ཤེས་པར་དཀའ་བ་དང་རང་སངས་རྒྱས་རྣམས་ཀྱིས་མི་ཤེས་པ་དང་མུ་སྟེགས་ཅན་གྱི་ས་མ་ཡིན་པ་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཡོངས་སུ་གཟུང་བ་དང་སྟོབས་བཅུ་དག་གིས་རྗེས་སུ་རྟོགས་པ་དང་། ལྷ་རྣམས་ཀྱིས་མཆོད་པར་བྱ་བ་དང་ཚངས་པས་ཕྱག་བྱ་བ་དང་བརྒྱ་བྱིན་རྣམས་ཀྱིས་སྔོན་དུ་འགྲོ་བར་བྱ་བ་དང་། ཀླུ་རྣམས་ཀྱིས་ཕྱག་བྱ་བ་དང་། གནོད་སྦྱིན་རྣམས་ཀྱིས་རྗེས་སུ་ཡི་རང་བར་བྱ་བ་དང་། མིའམ་ཅི་རྣམས་ཀྱིས་བསྟོད་པར་བྱ་བ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱིས་བསྔགས་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བསྒོམ་པར་བྱ་བ་དང་། མཁས་པ་རྣམས་ཀྱིས་ཀུན་ཆུབ་པར་བྱ་བ་དང་། བླ་ན་མེད་པའི་ནོར་དུ་གྱུར་པ་དང་། ཟང་ཟིང་མེད་པའི་སྦྱིན་པ་དང་། ནད་པ་རྣམས་ཀྱི་སྨན་དུ་གྱུར་པ་དང་། ཡེ་ཤེས་ཀྱི་མཛོད་དུ་གྱུར་པ་དང་། སྤོབས་པ་མི་ཟད་པ་དང་། མདོ་སྡེ་རྣམས་ཀྱི་ཚུལ་དུ་གྱུར་པ་དང་། དཔའ་བོ་དག་གི་གཡུལ་དུ་གྱུར་པ་དང་། ཁམས་གསུམ་ཡོངས་སུ་ཤེས་པ་དང་། ཕ་རོལ་ཏུ་འགྲོ་བ་དག་ལ་གཟིངས་ལྟ་བུ་དང་། ཆུ་བོའི་ནང་དུ་ཞུགས་པ་དག་ལ་གྲུ་ལྟ་བུ་དང་། གྲགས་པ་འདོད་པ་དག་གི་གྲགས་པ་དང་། སངས་རྒྱས་རྣམས་ཀྱིས་བསྟོད་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་བསྔགས་པ་དང་། སྟོབས་བཅུ་རྣམས་ཀྱིས་བསྟོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དག་གི་ཡོན་ཏན་དང་། སྙིང་རྗེ་ཅན་དག་གི་བཏང་སྙོམས་དང་། ཉེས་པ་ཞི་བར་འདོད་པ་དག་གི་བྱམས་པ་དང་། ཐེག་པ་ཆེན་པོ་དག་གི་དབུགས་འབྱིན་པ་དང་། སེང་གེའི་སྒྲ་སྒྲོགས་པ་རྣམས་ཀྱི་ནན་ཏན་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་ལམ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་གྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྐྱེད་མོས་ཚལ་དུ་གྱུར་པ་དང་། བདུད་ཀྱི་སྡེ་རྣམས་སྐྲག་པར་བྱེད་པ་དང་། བདེ་བར་འགྲོ་བ་རྣམས་ཀྱི་རིག་པ་དང་། དོན་སྒྲུབ་པ་རྣམས་ཀྱི་དོན་དང་། དགྲའི་ནང་དུ་སོང་བ་དག་གི་སྐྱབས་དང་། ཕྱིར་རྒོལ་བ་རྣམས་ཆོས་དང་འཐུན་པས་ཚར་གཅོད་པ་དང་། མི་འཇིགས་པ་རྣམས་ཀྱི་བདེན་པའི་རྣམ་པ་དང་། སྟོབས་རྣམས་ཡང་དག་པར་ཚོལ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་ཀྱི་སྔ་ལྟས་སུ་གྱུར་པ་དང་། ཆོས་ཀྱི་སྐུའི་རྒྱན་དང་སྤྱོད་པ་རྣམས་ཀྱི་རྒྱུ་འཐུན་པ་དང་། སངས་རྒྱས་ཀྱི་སྲས་རྣམས་ཀྱི་རྒྱན་དང་། ཐར་པ་འདོད་པ་རྣམས་ཀྱི་དགའ་བ་དང་། སྲས་ཐུ་བོ་རྣམས་ཀྱི་དགའ་བ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ས་མ་ཡིན་པ་དང་། སེམས་རྣམ་པར་དག་པ་དང་། ལུས་ཡོངས་སུ་དག་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་ཡོངས་སུ་རྫོགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། འདོད་ཆགས་འབྱུང་བ་མེད་པ་དང་། ཞེ་སྡང་དང་བྲལ་བ་དང་། གཏི་མུག་གི་ས་མ་ཡིན་པ་དང་། ཡེ་ཤེས་འབྱུང་བ་དང་། རིག་པ་སྐྱེ་བ་དང་། མ་རིག་པ་སྤོང་བ་དང་། རྣམ་པར་གྲོལ་བ་སྙིང་པོར་བྱེད་པ་རྣམས་ཀྱི་ཚིམ་པ་དང་། ཏིང་ངེ་འཛིན་སྙིང་པོར་བྱེད་པ་རྣམས་ཀྱི་དགའ་བ་དང་། ལྟ་འདོད་པ་རྣམས་ཀྱི་མིག་ཏུ་གྱུར་པ་དང་། རྣམ་པར་འཕྲུལ་པར་འདོད་པ་རྣམས་ཀྱི་མངོན་པར་ཤེས་པ་དང་། མངོན་པར་སྒྲུབ་པར་འདོད་པ་རྣམས་ཀྱི་རྫུ་འཕྲུལ་དང་ཐོས་པ་དོན་དུ་གཉེར་བ་རྣམས་ཀྱི་གཟུངས་དང་། དྲན་པ་མི་བརྗེད་པ་དང་སངས་རྒྱས་རྣམས་ཀྱི་བྱིན་གྱིས་བརླབས་དང་། འདྲེན་པ་རྣམས་ཀྱི་ཐབས་མཁས་པ་དང་། མི་བརྩོན་པ་རྣམས་ཀྱི་ཕྲ་བ་དང་། ཤེས་པར་དཀའ་བ་དང་མ་གྲོལ་བ་དག་གིས་མི་ཤེས་པ་དང་། ཡི་གེ་རྣམས་ལྡོག་པ་དང་། སྒྲ་ཤེས་པར་དཀའ་བ་དང་། རྟོགས་པ་རྣམས་ཀྱིས་ཀུན་ཤེས་པ་དང་། དེས་པ་རྣམས་ཀྱིས་ཤེས་པ་དང་། འདོད་པ་ཆུང་བ་རྣམས་ཀྱིས་རབ་ཏུ་རྟོགས་པ་དང་། བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ཀྱིས་གཟུང་བ་དང་། དྲན་པ་དང་ལྡན་པ་རྣམས་ཀྱིས་བཅངས་པ་དང་། སྡུག་བསྔལ་ཟད་པ་དང་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པ་དང་སྲིད་པའི་འགྲོ་བ་དང་སྐྱེ་བའི་གནས་ཐམས་ཅད་གཅིག་ཏུ་ངེས་པར་བསྟན་པ་སྟེ། གཞོན་ནུ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ།
en: It is penetrating into beings. It is knowledge of phenomena. It is the knowledge of engaging in discernment. It is the knowledge of the different kinds of letters and words. It is the transcendence of matter. It is the understanding of sounds. It is the attainment of joy. It is experiencing the joy of the Dharma. It is sincerity. It is tolerance. It is to be without deception. “It is to be without frowns. It is to be pleasant. It is to have correct conduct. It is to be friendly. It is to be gentle. It is having a smiling face. It is being courteous. It is to be welcoming. “It is to be without laziness. It is having veneration for the guru. It is respect for the guru. It is being content with occurrences. It is never being satisfied with the good actions one has done. It is having a pure livelihood. It is not forsaking the solitary life. “It is the knowledge of successive levels. It is always maintaining mindfulness. It is being wise concerning the skandhas. It is being wise concerning the dhātus. It is being wise concerning the āyatanas. It is making one’s higher cognitions manifest to others. “It is the elimination of kleśas. It is ceasing engagement with propensities. It is having specific attainments. It is the natural result of meditation. “It is skillfulness in eliminating transgressions. It is the prevention of the arising of bad actions. It is the elimination of attachment. “It is transcending the existences. It is the memory of previous rebirths. It is being free from doubt concerning the ripening of karma. “It is the contemplation of phenomena. It is seeking to hear the Dharma. It is having sharp knowledge. It is craving for wisdom. It is the realization of wisdom. “It is the level of a noble being. It is having a mind like a mountain. It is being unshakable. It is being immovable. It is the knowledge of the nature of the level of irreversibility. “It is having the natural result of good qualities. It is the abhorrence of bad qualities. It is being free of behavior caused by the kleśas. It is never abandoning the training. “It is being established in samādhi. It is the knowledge of the thoughts of beings. It is the knowledge of the various rebirths of beings. It is knowledge of the infinite. It is the knowledge of the intended meaning of words. “It is the rejection of living in a home. It is finding no joy in the three realms. It is having a motivation that is not discouraged. It is having no attachment to phenomena.

source: །ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་བསྟན་པ་འདི་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་པ་ན་ལྷ་དང་མིའི་སྐྱེ་དགུ་སྔོན་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་ཅུས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་གིས་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུ་རྩ་གསུམ་གྱིས་སྒྲའི་རྗེས་སུ་འབྲང་བའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །དགེ་སློང་སྟོང་དུ་ཚང་བ་ལེན་པ་མེད་པར་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །ལྷ་དང་མིའི་སྐྱེ་དགུ་ལས་སྲོག་ཆགས་སྟོང་ཕྲག་དྲུག་ཅུས་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ།
en: “It is having possession of the sacred Dharma. It is protecting the Dharma. It is conviction in the ripening of karma. It is skill in the vinaya. “It is the pacification of disputes. It is the absence of discord and the absence of quarrels. It is having reached the level of patience. It is maintaining patience. “It is the equality of the different kinds of beings. It is skill in examining phenomena. It is skill in gaining certainty concerning phenomena. “It is the knowledge of distinguishing between the words for phenomena. It is skill in the presentation of the words for phenomena. It is the knowledge of the skill of presenting the distinction between words that have meaning and those that do not have meaning. “It is knowledge of the past. It is knowledge of the future. It is knowledge of the present. It is the knowledge of the equality of the three times. It is the knowledge of the purity of the three aspects of actions. “It is the knowledge of the body’s condition. It is the knowledge of the mind’s condition. It is guarding conduct. It is having unshakable conduct. It is uncontrived conduct. It is engaging in conduct that is attractive. “It is the knowledge of skill in what is beneficial and what is not beneficial. It is rational speech. It is knowledge of the world. “It is unrestrained generosity. It is being openhanded. It is having a nongrasping mind. “It is having a sense of modesty and self-respect. It is an abhorrence of negative aspirations. It is not forsaking the qualities of purification. It is maintaining correct conduct. It is joyful conduct. “It is standing up to welcome gurus and presenting them with a seat. It is the elimination of pride. It is controlling the mind. It is the knowledge of generating enthusiasm. “It is the knowledge of discernment. It is the realization of wisdom. It is being without ignorance. It is knowledge of the processes of the mind. It is the knowledge that realizes the nature of the mind. “It is the knowledge of accomplishment and definite accomplishment. It is the knowledge of all language. It is the knowledge of presenting definitions. It is the knowledge of attaining certainty in meaning. “It is abandoning that which is harmful. It is attending upon excellent beings. It is being together with excellent beings. It is avoiding bad beings. “It is the accomplishment of dhyāna. It is not savoring dhyāna. “It is the utilization of the higher cognitions. It is the knowledge that comprehends the nature of assigned names and designations. It is overcoming designations. It is disillusionment with saṃsāra. “It is the absence of yearning for respect. It is indifference to lack of respect. It is not being motivated by material gain. It is not being disheartened when there is no gain. It is the absence of interest in honor. It is the absence of anger at dishonor. It is the absence of attachment to praise. It is the absence of displeasure in response to criticism. It is the absence of attachment to happiness. It is the absence of aversion to suffering. It is not being acquisitive of composite things. It is having no attachment to renown. It is accepting the lack of renown. “It is not associating with householders and mendicants. It is avoiding that which is outside the scope of correct conduct. It is acting within the scope of correct conduct. It is a perfection of correct conduct. It is rejecting incorrect conduct. It is not dishonoring your family. “It is preserving the teaching. It is speaking little. It is speaking softly. It is speaking slowly. It is skillfulness in answers. It is defeating opposition. It is arriving at the right time. It is not relying on ordinary people. “It is not having contempt for those in suffering. It is giving them charity. It is not rebuking the poor. It is having compassion for those with wrong conduct. It is having that which will bring benefit to others. It is having a compassionate mind. It is benefiting others through the Dharma. It is giving away material things. It is the absence of hoarding. “It is praising correct conduct. It is condemning incorrect conduct. It is unwaveringly attending upon those who have correct conduct. It is giving up all possessions. It is welcoming others with a higher motivation. It is doing exactly what one has said one will do. It is perpetual application. It is experiencing joy through veneration. “It is the knowledge of using examples. It is being skilled in terms of past lifetimes. It is putting roots of merit first. It is skill in methods. “It is the negation of attributes. It is rejecting identification. It is knowledge of the characteristics of things. “It is the accomplishment of the sūtras. It is skill in the vinaya. It is certainty in the truth. It is the direct experience of liberation. It is the single teaching. It is not abandoning correct knowing and seeing. It is speech free of doubt. “It is remaining in emptiness. It is remaining in the absence of attributes. It is understanding the nature of the absence of aspiration. It is the attainment of fearlessness. “It is illumination by wisdom. It is excellent correct conduct. It is entering into samāpatti. It is the attainment of wisdom. “It is delighting in solitude. It is knowledge of oneself. It is contentment with having no high reputation. “It is the absence of pollution in the mind. It is rejecting incorrect views. It is the attainment of mental retention. “It is the entrance into knowledge. It is the knowledge of the basis, the ground, the foundation, and the practice. It is the cause, the method, the way, the creation, the doorway, the path, the practice, the guidance, the explication, and the conduct of the instruction. “It is appropriate patience. It is the level of patience. It is being free of impatience. It is the level of knowledge. It is the elimination of ignorance. It is being established in knowledge. “It is the level of spiritual practice. It is the scope of practice of the bodhisattvas. “It is attending upon wise beings. It is rejecting those who are not wise beings. It is the knowledge that analyzes and realizes the nature of all phenomena. “It is the level of buddhahood taught by the tathāgatas. The wise rejoice in it. The foolish reject it. It is difficult for the śrāvakas to know. The pratyekabuddhas do not know it. It is not the level of the tīrthikas. The bodhisattvas possess it. It is realized by those who have the ten strengths. The devas make offerings to it. Brahmā praises it. The Śakras value it above all else. The nāgas pay homage to it. The yakṣas rejoice in it. The kinnaras praise it in song. The mahoragas laud it. The bodhisattvas meditate on it. The wise comprehend it. “It is the highest wealth. It is immaterial generosity. It is a medicine for the sick. It is a treasure of wisdom. It is unceasing eloquence. “It is the way of the sūtras. It is the domain of heroes. It is the comprehension of the entire three realms. It is a raft for crossing to the other shore. It is like a boat for those in the middle of a river. “It is fame for those who wish for renown. The buddhas praise it. The tathāgatas laud it. Those who have the ten strengths praise it. “It is the quality of the bodhisattvas. It is the equanimity of those with compassion. It is the love that brings anger to an end. “It is the delight of those with peaceful minds. It provides relief for those who follow the Mahāyāna. “It is the diligent practice of those with a lion’s roar. It is the path of the wisdom of the buddhas. “It is the seal upon all phenomena. It is the accomplishment of omniscient wisdom. “It is the pleasure grove of bodhisattvas. It is that which terrifies the māras. “It is the knowledge of those who have reached happiness. It is the benefit of those who accomplish benefit. “It is the refuge for those among enemies. It is the subjugation of adversaries by those who have the Dharma. “It is the expression of truth for those who have fearlessness. It is the correct search for the strengths. It is the omen for the eighteen unique qualities of a buddha. It is the adornment of the Dharma body. It is the natural result of bodhisattva conduct. It is the adornment of the bodhisattvas. It is the delight of those who desire liberation. It is the joy of the eldest sons. “It is the completion of buddha wisdom. It is not the level of śrāvakas or pratyekabuddhas. “It is the purity of the mind. It is the purity of the body. It is the completion of the doorways to liberation. “It is the wisdom of buddhahood’s freedom from the kleśas. It is the nonarising of desire. It is devoid of anger. “It is not the level of ignorance. It is the arising of wisdom. It is the birth of knowledge. It is the elimination of ignorance. “It is the contentment of those dedicated to liberation. It is the satisfaction of those dedicated to samādhi. It is eyes for those who wish for the view. It is higher knowledge for those who wish to perform miracles. It is miraculous power for those who wish for accomplishment. It is retentive memory for those dedicated to listening to the Dharma. “It is unceasing mindfulness. It is the blessing of the buddhas. It is the skillful method of the guides. “It is subtle and difficult to know for those without dedication. Those who are not liberated cannot know it. It is beyond words and difficult to know through speech. “It is known by wise beings. It is the knowledge of gentle beings. Those with few desires realize it. Those who have unceasing diligence possess it. Those who are mindful maintain it. “It is the cessation of suffering. It is the birthlessness of all phenomena. It is the single teaching on all existing beings and lifetimes. “Young man, this is the samādhi called the revealed equality of the nature of all phenomena.” When the Bhagavān gave this teaching of the samādhi, the revealed equality of the nature of all phenomena, in the past, eighty times a hundred thousand million devas and humans, who had previously generated the necessary karma, attained the patience of the birthlessness of phenomena, ninety-six times a hundred thousand million attained the corresponding patience, ninety-three times a hundred thousand million obtained the transmission of the teaching of that patience, and the entirety of the hundred thousand bhikṣus attained liberation of mind through the defilements not arising. Sixty times a hundred thousand devas and human beings became free of desire, without stains, and gained the pure Dharma sight of the Dharmas.

source: །དགེ་སློང་མ་བརྒྱད་ཁྲི་ལེན་པ་མེད་པར་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: Eighty thousand bhikṣuṇīs attained liberation of mind through the nonarising of defilements.

source: །དགེ་བསྙེན་ལྔ་བརྒྱས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཐོབ་པར་གྱུར་ཏོ།
en: Five hundred upāsakas attained the result of nonreturners.

source: །དགེ་བསྙེན་མ་དྲུག་སྟོང་གིས་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཐོབ་པར་གྱུར་ཏོ།
en: Six thousand upāsikās attained the result of once-returners.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་གཡོས།
en: This universe of a thousand million worlds shook in six ways:

source: རབ་ཏུ་གཡོས་ཀུན་ཏུ་རབ་ཏུ་གཡོས། འགུལ་རབ་ཏུ་འགུལ་ཀུན་ཏུ་རབ་ཏུ་འགུལ།
en: it trembled, it trembled strongly, and it trembled intensely;

source: ལྡེག་རབ་ཏུ་ལྡེག་ཀུན་ཏུ་རབ་ཏུ་ལྡེག །འཁྲུགས་རབ་ཏུ་འཁྲུགས་ཀུན་ཏུ་རབ་ཏུ་འཁྲུགས།
en: it quivered, it quivered strongly, and it quivered intensely; it shook, it shook strongly, and it shook intensely;

source: ཆེམ་ཆེམ་རབ་ཏུ་ཆེམ་ཆེམ་ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ།
en: it shuddered, it shuddered strongly, and it shuddered intensely;

source: འུར་འུར་རབ་ཏུ་འུར་འུར་ཀུན་ཏུ་རབ་ཏུ་འུར་འུར་ཏེ།
en: it quaked, it quaked strongly, and it quaked intensely.
